package v1

// DATA MAPPINGS
var thaiCharToNumberMap = map[rune]int{
	'ก': 1, 'ด': 1, 'ถ': 1, 'ท': 1, 'ภ': 1, 'ฤ': 1,
	'ข': 2, 'บ': 2, 'ป': 2, 'ง': 2, 'ช': 2,
	'ต': 3, 'ฑ': 3, 'ฒ': 3, 'ฆ': 3,
	'ค': 4, 'ธ': 4, 'ร': 4, 'ญ': 4, 'ษ': 4,
	'ฉ': 5, 'ณ': 5, 'ฌ': 5, 'น': 5, 'ม': 5, 'ห': 5, 'ฮ': 5, 'ฎ': 5, 'ฬ': 5,
	'จ': 6, 'ล': 6, 'ว': 6, 'อ': 6,
	'ซ': 7, 'ศ': 7, 'ส': 7,
	'ย': 8, 'ผ': 8, 'ฝ': 8, 'พ': 8, 'ฟ': 8,
	'ฏ': 9, 'ฐ': 9,
}

// LUCKY POINT DATA
var luckyPointStore = []LuckyPoint{
	{1, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 1 เหมาะสำหรับผู้ที่มีตำแหน่งหน้าที่การงานสูง เช่น ข้าราชการ หัวหน้างาน หรือเจ้าของกิจการ เลขนี้ช่วยเสริมสร้างความเป็นผู้นำ อำนาจวาสนา และเพิ่มความน่าเชื่อถือในสายตาผู้อื่น"},
	{2, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 2 เหมาะสำหรับผู้ที่ทำงานด้านบริการ การเงิน การธนาคาร หรือผู้ที่ประกอบธุรกิจส่วนตัว เลขนี้ช่วยเสริมด้านการเงิน ความมั่นคง และความสำเร็จในงานที่เกี่ยวข้องกับการดูแลและบริการ"},
	{3, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 3 เหมาะสำหรับผู้ที่ทำงานในเครื่องแบบ เช่น ทหาร ตำรวจ แพทย์ หรือพยาบาล รวมถึงช่างฝีมือ เลขนี้ช่วยเสริมพลังในการทำงาน แต่ควรระวังเรื่องอารมณ์ที่อาจทำให้ขับรถใจร้อนหรือหงุดหงิดง่าย"},
	{4, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 4 เหมาะสำหรับผู้ที่ทำงานด้านการสื่อสาร เช่น ผู้สื่อข่าว พิธีกร หรือผู้ที่ต้องเจรจาติดต่อ เลขนี้ช่วยเสริมชื่อเสียง ความสำเร็จ และการยอมรับในวงการที่เกี่ยวข้อง"},
	{5, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 5 เหมาะสำหรับผู้ที่ทำงานด้านการศึกษา กระบวนการยุติธรรม เช่น ครู ทนายความ หรือผู้พิพากษา รวมถึงแพทย์และพยาบาล เลขนี้ช่วยเสริมความน่าเชื่อถือและความเคารพนับถือจากผู้อื่น"},
	{6, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 6 เหมาะสำหรับผู้ที่ทำงานในสายบันเทิง ธุรกิจเสริมความงาม หรือการค้าขายของสวยงาม เลขนี้ช่วยเสริมโชคลาภด้านการเงิน ความปลอดภัย และความรักใคร่จากผู้คนรอบข้าง"},
	{7, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 7 เหมาะสำหรับผู้ที่ทำงานด้านการเกษตร การขนส่ง หรือผู้ที่ชอบวิถีชีวิตเรียบง่าย เลขนี้ช่วยเสริมความอดทน สติปัญญา และความมุ่งมั่นในการทำงาน"},
	{8, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 8 เหมาะสำหรับผู้ที่ทำงานในเวลากลางคืน อาชีพที่มีความเสี่ยง หรือผู้ที่สนใจด้านโหราศาสตร์ เลขนี้ช่วยเสริมความมั่งคั่ง ความสำเร็จ และการยกย่องจากผู้อื่น"},
	{9, "เลขทะเบียนรถที่มีผลรวมเท่ากับ 9 ถือเป็นเลขมงคลที่เหมาะสำหรับทุกคน เลขนี้ช่วยเสริมสิ่งศักดิ์สิทธิ์คุ้มครอง ความปลอดภัยจากอุบัติเหตุ และความก้าวหน้าในชีวิต"},
}

// LuckyPointGroup represents a group of lucky points with a description for Overall of your plate(Sum)
var luckyPointGroups = []LuckyPointGroup{
	{
		Group:  "best",
		Points: []int{4, 5, 6, 9, 14, 15, 19, 23, 24, 32, 36, 40, 41, 42, 44, 45, 46, 50, 51, 54},
		Desc:   "เลขมงคลระดับดีเยี่ยม ช่วยเสริมดวงให้เจ้าของรถประสบความสำเร็จในชีวิต ส่งเสริมความก้าวหน้าในหน้าที่การงาน เพิ่มโชคลาภด้านการเงิน นำมาซึ่งความมั่งคั่งร่ำรวย และเป็นที่เคารพนับถือของคนรอบข้าง ช่วยเสริมสิริมงคลและความเจริญรุ่งเรืองให้กับชีวิต",
	},
	{
		Group:  "medium",
		Points: []int{8, 10, 13, 16, 18, 22, 25, 26, 28, 31, 35, 38, 39, 47, 49, 52, 53},
		Desc:   "เลขมงคลระดับปานกลาง ชีวิตจะมีความสำเร็จหากมีความพยายามและไม่ย่อท้อต่ออุปสรรค ต้องอาศัยความอดทนและความมุ่งมั่นเพื่อฝ่าฟันปัญหา เมื่อผ่านช่วงเวลายากลำบากไปได้ จะพบกับความสำเร็จและความมั่นคงในชีวิต การงานอาจมีอุปสรรคบ้างแต่สามารถแก้ไขได้ด้วยความพยายาม",
	},
	{
		Group:  "bad",
		Points: []int{3, 7, 11, 12, 17, 20, 21, 27, 29, 30, 33, 34, 37, 43, 48},
		Desc:   "เลขทะเบียนที่อาจนำมาซึ่งความยากลำบาก ชีวิตจะพบเจออุปสรรคและความท้าทายอยู่บ่อยครั้ง ต้องใช้ความอดทนสูงมาก อาจพบปัญหาต่าง ๆ เข้ามาให้แก้ไขอยู่เสมอ ทั้งเรื่องการงาน การเงิน และความสัมพันธ์ ควรระมัดระวังในการใช้รถ และอาจต้องปรับเปลี่ยนทะเบียนหรือเสริมสิริมงคลด้วยวิธีอื่นเพิ่มเติม",
	},
}

// advice by Day of birth
var luckyNumberAdvice = []LuckyNumberAdvice{
	{
		Day:           0,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันอาทิตย์",
		LuckyNum:      []int{1, 5, 7, 9},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันอาทิตย์",
		AvoidNum:      []int{6, 3},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันอาทิตย์",
		AvoidChar:     []string{"ศ", "ษ", "ส", "ห", "ฬ", "ฮ"},
	},
	{
		Day:           1,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันจันทร์",
		LuckyNum:      []int{2, 4, 6, 8},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันจันทร์",
		AvoidNum:      []int{1, 5},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันจันทร์",
		AvoidChar:     []string{"อ"},
	},
	{
		Day:           2,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันอังคาร",
		LuckyNum:      []int{3, 5, 6},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันอังคาร",
		AvoidNum:      []int{1, 2},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันอังคาร",
		AvoidChar:     []string{"ก", "ข", "ค", "ฆ", "ง"},
	},
	{
		Day:           3,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันพุธ(กลางวัน)",
		LuckyNum:      []int{7, 8, 6, 5},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันพุธ(กลางวัน)",
		AvoidNum:      []int{3, 8},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันพุธ(กลางวัน)",
		AvoidChar:     []string{"จ", "ฉ", "ช", "ซ", "ฌ", "ญ"},
	},
	{
		Day:           4,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันพฤหัสบดี",
		LuckyNum:      []int{2, 4, 6, 8},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันพฤหัสบดี",
		AvoidNum:      []int{8},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันพฤหัสบดี",
		AvoidChar:     []string{"ด", "ต", "ถ", "ท", "ธ", "น"},
	},
	{
		Day:           5,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันศุกร์",
		LuckyNum:      []int{1, 3, 5, 7, 9},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันศุกร์",
		AvoidNum:      []int{7, 8},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันศุกร์",
		AvoidChar:     []string{"ย", "ร", "ล", "ว"},
	},
	{
		Day:           6,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันเสาร์",
		LuckyNum:      []int{1, 5, 7, 9},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันเสาร์",
		AvoidNum:      []int{4, 6},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันเสาร์",
		AvoidChar:     []string{"ฎ", "ฏ", "ฐ", "ฑ", "ฒ", "ณ"},
	},
	{
		Day:           7,
		LuckyNumDesc:  "เลขมงคลสำหรับคนเกิดวันพุธ(กลางคืน)",
		LuckyNum:      []int{7, 8, 6},
		AvoidNumDesc:  "เลขอัปมงคลสำหรับคนเกิดวันพุธ(กลางคืน)",
		AvoidNum:      []int{5, 4},
		AvoidCharDesc: "ตัวอักษรที่ควรหลีกเลี่ยงสำหรับคนเกิดวันพุธ(กลางคืน)",
		AvoidChar:     []string{"บ", "ป", "ผ", "ฝ", "พ", "ฟ", "ภ", "ม"},
	},
}
